balazsgrill/modembed/res/Devices/18xxxx/PIC18F45K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B0D2" edc:desc="" edc:mask="0xff" edc:name="B0D2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B0D20" edc:desc="" edc:mask="0x1" edc:name="B0D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D21" edc:desc="" edc:mask="0x1" edc:name="B0D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D22" edc:desc="" edc:mask="0x1" edc:name="B0D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D23" edc:desc="" edc:mask="0x1" edc:name="B0D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D24" edc:desc="" edc:mask="0x1" edc:name="B0D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D25" edc:desc="" edc:mask="0x1" edc:name="B0D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D26" edc:desc="" edc:mask="0x1" edc:name="B0D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D27" edc:desc="" edc:mask="0x1" edc:name="B0D27" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B0D3" edc:desc="" edc:mask="0xff" edc:name="B0D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B0D30" edc:desc="" edc:mask="0x1" edc:name="B0D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D31" edc:desc="" edc:mask="0x1" edc:name="B0D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D32" edc:desc="" edc:mask="0x1" edc:name="B0D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D33" edc:desc="" edc:mask="0x1" edc:name="B0D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D34" edc:desc="" edc:mask="0x1" edc:name="B0D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D35" edc:desc="" edc:mask="0x1" edc:name="B0D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D36" edc:desc="" edc:mask="0x1" edc:name="B0D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D37" edc:desc="" edc:mask="0x1" edc:name="B0D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B0D4" edc:desc="" edc:mask="0xff" edc:name="B0D4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B0D40" edc:desc="" edc:mask="0x1" edc:name="B0D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D41" edc:desc="" edc:mask="0x1" edc:name="B0D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D42" edc:desc="" edc:mask="0x1" edc:name="B0D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D43" edc:desc="" edc:mask="0x1" edc:name="B0D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D44" edc:desc="" edc:mask="0x1" edc:name="B0D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D45" edc:desc="" edc:mask="0x1" edc:name="B0D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D46" edc:desc="" edc:mask="0x1" edc:name="B0D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D47" edc:desc="" edc:mask="0x1" edc:name="B0D47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B0D5" edc:desc="" edc:mask="0xff" edc:name="B0D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B0D50" edc:desc="" edc:mask="0x1" edc:name="B0D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D51" edc:desc="" edc:mask="0x1" edc:name="B0D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D52" edc:desc="" edc:mask="0x1" edc:name="B0D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D53" edc:desc="" edc:mask="0x1" edc:name="B0D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D54" edc:desc="" edc:mask="0x1" edc:name="B0D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D55" edc:desc="" edc:mask="0x1" edc:name="B0D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D56" edc:desc="" edc:mask="0x1" edc:name="B0D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D57" edc:desc="" edc:mask="0x1" edc:name="B0D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B0D6" edc:desc="" edc:mask="0xff" edc:name="B0D6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B0D60" edc:desc="" edc:mask="0x1" edc:name="B0D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D61" edc:desc="" edc:mask="0x1" edc:name="B0D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D62" edc:desc="" edc:mask="0x1" edc:name="B0D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D63" edc:desc="" edc:mask="0x1" edc:name="B0D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D64" edc:desc="" edc:mask="0x1" edc:name="B0D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D65" edc:desc="" edc:mask="0x1" edc:name="B0D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D66" edc:desc="" edc:mask="0x1" edc:name="B0D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D67" edc:desc="" edc:mask="0x1" edc:name="B0D67" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B0D7" edc:desc="" edc:mask="0xff" edc:name="B0D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B0D70" edc:desc="" edc:mask="0x1" edc:name="B0D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D71" edc:desc="" edc:mask="0x1" edc:name="B0D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D72" edc:desc="" edc:mask="0x1" edc:name="B0D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D73" edc:desc="" edc:mask="0x1" edc:name="B0D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D74" edc:desc="" edc:mask="0x1" edc:name="B0D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D75" edc:desc="" edc:mask="0x1" edc:name="B0D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D76" edc:desc="" edc:mask="0x1" edc:name="B0D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0D77" edc:desc="" edc:mask="0x1" edc:name="B0D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO9" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1_ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2_ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3_ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE3" edc:desc="" edc:mask="0x1" edc:name="EICODE3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO9" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0_FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1_FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2_FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FP1" edc:desc="" edc:mask="0x1" edc:name="FP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP2" edc:desc="" edc:mask="0x1" edc:name="FP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP3" edc:desc="" edc:mask="0x1" edc:name="FP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="B1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="B1CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0/TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1/TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2/RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3/TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4/TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO/TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1/TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL/TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0_TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1_TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2_RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3_TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4_TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO_TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1_TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL_TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0xff" edc:name="SID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
