balazsgrill/modembed/res/Devices/18xxxx/PIC18F45K80.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="PMD2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----xxx" edc:name="PMD2" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECANMD" edc:desc="" edc:mask="0x1" edc:name="ECANMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PMD1" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0MD" edc:desc="" edc:mask="0x1" edc:name="TMR0MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSPMD" edc:desc="" edc:mask="0x1" edc:name="PSPMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PMD0" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPMD" edc:desc="" edc:mask="0x1" edc:name="SSPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART1MD" edc:desc="" edc:mask="0x1" edc:name="UART1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART2MD" edc:desc="" edc:mask="0x1" edc:name="UART2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3MD" edc:desc="" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4MD" edc:desc="" edc:mask="0x1" edc:name="CCP4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5MD" edc:desc="" edc:mask="0x1" edc:name="CCP5MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCB" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxx----" edc:name="IOCB" edc:nzwidth="8" edc:por="xxxx----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCB4" edc:desc="" edc:mask="0x1" edc:name="IOCB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCB5" edc:desc="" edc:mask="0x1" edc:name="IOCB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCB6" edc:desc="" edc:mask="0x1" edc:name="IOCB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCB7" edc:desc="" edc:mask="0x1" edc:name="IOCB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUB" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="WPUB" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUB0" edc:desc="" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB1" edc:desc="" edc:mask="0x1" edc:name="WPUB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB2" edc:desc="" edc:mask="0x1" edc:name="WPUB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB3" edc:desc="" edc:mask="0x1" edc:name="WPUB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB4" edc:desc="" edc:mask="0x1" edc:name="WPUB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB5" edc:desc="" edc:mask="0x1" edc:name="WPUB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB6" edc:desc="" edc:mask="0x1" edc:name="WPUB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB7" edc:desc="" edc:mask="0x1" edc:name="WPUB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="ANCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="ANCON1" edc:nzwidth="8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSEL8" edc:desc="" edc:mask="0x1" edc:name="ANSEL8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL9" edc:desc="" edc:mask="0x1" edc:name="ANSEL9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL10" edc:desc="" edc:mask="0x1" edc:name="ANSEL10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL11" edc:desc="" edc:mask="0x1" edc:name="ANSEL11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL12" edc:desc="" edc:mask="0x1" edc:name="ANSEL12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL13" edc:desc="" edc:mask="0x1" edc:name="ANSEL13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL14" edc:desc="" edc:mask="0x1" edc:name="ANSEL14" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANCON0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ANCON0" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSEL0" edc:desc="" edc:mask="0x1" edc:name="ANSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL1" edc:desc="" edc:mask="0x1" edc:name="ANSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL2" edc:desc="" edc:mask="0x1" edc:name="ANSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL3" edc:desc="" edc:mask="0x1" edc:name="ANSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL4" edc:desc="" edc:mask="0x1" edc:name="ANSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL5" edc:desc="" edc:mask="0x1" edc:name="ANSEL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL6" edc:desc="" edc:mask="0x1" edc:name="ANSEL6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL7" edc:desc="" edc:mask="0x1" edc:name="ANSEL7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CM2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CM2CON" edc:nzwidth="8" edc:por="00011111">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="CM2CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CON" edc:desc="" edc:mask="0x1" edc:name="CON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCH0" edc:desc="" edc:mask="0x1" edc:name="CCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCH1" edc:desc="" edc:mask="0x1" edc:name="CCH1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL0" edc:desc="" edc:mask="0x1" edc:name="EVPOL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL1" edc:desc="" edc:mask="0x1" edc:name="EVPOL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CM1CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0x0xxxxx" edc:name="CM1CON" edc:nzwidth="0x8" edc:por="00011111">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="CM1CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CON" edc:desc="" edc:mask="0x1" edc:name="CON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCH0" edc:desc="" edc:mask="0x1" edc:name="CCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCH1" edc:desc="" edc:mask="0x1" edc:name="CCH1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL0" edc:desc="" edc:mask="0x1" edc:name="EVPOL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL1" edc:desc="" edc:mask="0x1" edc:name="EVPOL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="cnnrrnrr" edc:cname="RXB0CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXB0CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="JTOFF_FILHIT1" edc:desc="" edc:mask="0x1" edc:name="JTOFF_FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0DBEN_FILHIT2" edc:desc="" edc:mask="0x1" edc:name="RB0DBEN_FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_FILHIT3" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO_FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM0_RTRRO" edc:desc="" edc:mask="0x1" edc:name="RXM0/RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="JTOFF" edc:desc="" edc:mask="0x1" edc:name="JTOFF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0DBEN" edc:desc="" edc:mask="0x1" edc:name="RB0DBEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXM0" edc:desc="" edc:mask="0x1" edc:name="RXM0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0xff" edc:name="SID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrr-rr" edc:cname="RXB0SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="RXB0SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7" edc:name="SID" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="RXB0DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0uuuuuuu" edc:name="RXB0DLC" edc:nzwidth="0x8" edc:por="0xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="" edc:mask="0xf" edc:name="DLC" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0x3" edc:name="RB" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
